   #                                                  Titanic Exercise I
   #### Practice pandas

![titanic](https://userscontent2.emaze.com/images/a5f68f37-6349-4065-a1fc-921cbe7401b2/958230111417e36d6b3c67ffd7bc3494.jpeg)

First of all, import the needed libraries.

In [1]:
import numpy as np
import pandas as pd
# you will have to import at least another library along the exercise do it in here when the time comes
import random

/home/jose/.local/lib/python3.7/site-packages/pandas/compat/__init__.py:97: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

1. Read in filename and call the variable `titanic`
    - Explore the `titanic` dataset using `info`, `dtypes` & `describe`

In [2]:
filename = "titanic.csv"

In [4]:
titanic = pd.read_csv('./data/' + filename)

In [9]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [14]:
titanic.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [12]:
titanic.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881138,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413493,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.170000,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

2. Create a separate dataframe with the columns `['name', 'sex', 'age']`, call it `people`

It can be done two ways, do it both!

In [15]:
people = titanic[['name', 'sex', 'age']]
people.head()

                                              name     sex    age
0                    Allen, Miss. Elisabeth Walton  female  29.00
1                   Allison, Master. Hudson Trevor    male   0.92
2                     Allison, Miss. Helen Loraine  female   2.00
3             Allison, Mr. Hudson Joshua Creighton    male  30.00
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.00

In [16]:
people = titanic.loc[:, 'name':'age']
people.head()

                                              name     sex    age
0                    Allen, Miss. Elisabeth Walton  female  29.00
1                   Allison, Master. Hudson Trevor    male   0.92
2                     Allison, Miss. Helen Loraine  female   2.00
3             Allison, Mr. Hudson Joshua Creighton    male  30.00
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.00

3. Print the output of `people` showing the first three rows and the last four rows, using `append`,`tail` and `head`

In [18]:
print(people.head(3), people.tail(4), sep='\n')

                             name     sex    age
0   Allen, Miss. Elisabeth Walton  female  29.00
1  Allison, Master. Hudson Trevor    male   0.92
2    Allison, Miss. Helen Loraine  female   2.00
                           name     sex   age
1305      Zabour, Miss. Thamine  female   NaN
1306  Zakarian, Mr. Mapriededer    male  26.5
1307        Zakarian, Mr. Ortin    male  27.0
1308         Zimmerman, Mr. Leo    male  29.0

4. Slice the row from 3 to 9, call it `s_titanic`

In [20]:
s_titanic = titanic.iloc[3:10]
s_titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

5. Slice the row from 40 to 63 in reverse order, call it `s_titanic_rev`

In [21]:
s_titanic_rev = titanic.iloc[63:39:-1]
s_titanic_rev

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
63,1,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,E31,S,4,NaN,"Amenia, ND"
62,1,0,"Chaffee, Mr. Herbert Fuller",male,46.0,1,0,W.E.P. 5734,61.1750,E31,S,NaN,NaN,"Amenia, ND"
61,1,1,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1,0,19877,78.8500,C46,S,6,NaN,"Little Onn Hall, Staffs"
60,1,0,"Cavendish, Mr. Tyrell William",male,36.0,1,0,19877,78.8500,C46,S,NaN,172.0,"Little Onn Hall, Staffs"
59,1,1,"Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...",female,NaN,0,0,17770,27.7208,NaN,C,5,NaN,"New York, NY"
58,1,0,"Case, Mr. Howard Brown",male,49.0,0,0,19924,26.0000,NaN,S,NaN,NaN,"Ascot, Berkshire / Rochester, NY"
57,1,1,"Carter, Mrs. William Ernest (Lucile Polk)",female,36.0,1,2,113760,120.0000,B96 B98,S,4,NaN,"Bryn Mawr, PA"
56,1,1,"Carter, Mr. William Ernest",male,36.0,1,2,113760,120.0000,B96 B98,S,C,NaN,"Bryn Mawr, PA"
55,1,1,"Carter, Miss. Lucile Polk",female,14.0,1,2,113760,120.0000,B96 B98,S,4,NaN,"Bryn Mawr, PA"
54,1,1,"Carter, Master. William Thornton II",male,11.0,1,2,113760,120.0000,B96 B98,S,4,NaN,"Bryn Mawr, PA"
53,1,0,"Carrau, Mr. Jose Pedro",male,17.0,0,0,113059,47.1000,NaN,S,NaN,NaN,"Montevideo, Uruguay"
52,1,0,"Carrau, Mr. Francisco M",male,28.0,0,0,113059,47.1000,NaN,S,NaN,NaN,"Montevideo, Uruguay"
51,1,0,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S,NaN,NaN,"New York, NY"
50,1,1,"Cardeza, Mrs. James Warburton Martinez (Charlo...",female,58.0,0,1,PC 17755,512.3292,B51 B53 B55,C,3,NaN,"Germantown, Philadelphia, PA"
49,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C,3,NaN,"Austria-Hungary / Germantown, Philadelphia, PA"
48,1,1,"Candee, Mrs. Edward (Helen Churchill Hungerford)",female,53.0,0,0,PC 17606,27.4458,NaN,C,6,NaN,"Washington, DC"
47,1,1,"Calderhead, Mr. Edward Pennington",male,42.0,0,0,PC 17476,26.2875,E24,S,5,NaN,"New York, NY"
46,1,0,"Cairns, Mr. Alexander",male,NaN,0,0,113798,31.0000,NaN,S,NaN,NaN,NaN
45,1,0,"Butt, Major. Archibald Willingham",male,45.0,0,0,113050,26.5500,B38,S,NaN,NaN,"Washington, DC"
44,1,1,"Burns, Miss. Elizabeth Margaret",female,41.0,0,0,16966,134.5000,E40,C,3,NaN,NaN
43,1,1,"Bucknell, Mrs. William Robert (Emma Eliza Ward)",female,60.0,0,0,11813,76.2917,D15,C,8,NaN,"Philadelphia, PA"
42,1,1,"Brown, Mrs. John Murray (Caroline Lane Lamson)",female,59.0,2,0,11769,51.4792,C101,S,D,NaN,"Belmont, MA"
41,1,1,"Brown, Mrs. James Joseph (Margaret Tobin)",female,44.0,0,0,PC 17610,27.7208,B4,C,6,NaN,"Denver, CO"
40,1,0,"Brewe, Dr. Arthur Jackson",male,NaN,0,0,112379,39.6000,NaN,C,NaN,NaN,"Philadelphia, PA"

6. Slice the columns from the starting column to `'parch'`, call it `left_columns`

In [23]:
left_columns = titanic.loc[:, :'parch']
left_columns.head()

,pclass,survived,name,sex,age,sibsp,parch
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2

7. Slice the columns from `'name'` to `'age'`, call it `middle_columns`

In [24]:
middle_columns = titanic.loc[:, 'name':'age']
middle_columns.head()

                                              name     sex    age
0                    Allen, Miss. Elisabeth Walton  female  29.00
1                   Allison, Master. Hudson Trevor    male   0.92
2                     Allison, Miss. Helen Loraine  female   2.00
3             Allison, Mr. Hudson Joshua Creighton    male  30.00
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.00

8. Slice the columns from `'ticket'` to the end, call it `right_columns`

In [25]:
right_columns = titanic.loc[:, 'ticket':]
right_columns.head()

,ticket,fare,cabin,embarked,boat,body,home.dest
0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

9. What is the name of the oldest person who died in the Titanic? Was he or she travelling alone or had any family travelling with them?

In [50]:
titanic[titanic.survived == 0]['age'].max()

74.0

In [51]:
titanic[titanic.age == 74]['name']

1235    Svensson, Mr. Johan
Name: name, dtype: object

In order to give an answer to the second question you should find out which columns give you that info. Usually part of your job as a Data Scientist will be get to know the dataset which you are working with. In this case the columns which give you that info are the following: 
        - 'sibsp' Number of Siblings/Spouses Aboard
        - 'parch' Number of Parents/Children Aboard

In [53]:
titanic.iloc[1235][['sibsp', 'parch']]
# Viajaba solo

sibsp    0
parch    0
Name: 1235, dtype: object

10. Create the list of 5 random numbers of rows from 0 to the lenght of the dataframe, call it `rows`

ex. `rows = [3,7,99,52,48]` use `random` library

In [147]:
rows = [random.randint(0, titanic.shape[0]) for i in range(5)]
rows

[387, 986, 318, 76, 209]

This list of numbers are random, could be different.

11. Create the list of three column labels, call it `cols`

In [154]:
cols = ['one', 'two', 'three', 'four', 'five']

12. Use both lists `rows` and `cols` to create a new dataframe

In [155]:
new_df = pd.DataFrame(data=[rows], columns=cols)
new_df

   one  two  three  four  five
0  387  986    318    76   209

13. Create a boolean array with the condition of being a woman or a man, using the `sex` column, where **female** is True. Call it `array_fe`

Bonus: Rename the column `"sex"` to `"gender"`

In [77]:
array_fe = titanic['sex'].values
array_fe = np.where(array_fe == 'female', True, False)
titanic = titanic.rename(columns={'sex': 'gender'})
titanic.head()

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

14. Filter the `titanic` dataframe with the boolean array, call it `woman_titanic`

In [78]:
woman_titanic = titanic[array_fe]
woman_titanic.head()

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"

15. How many woman were younger than 18? Call the variable `minor_wo`

In [82]:
minor_wo = woman_titanic[woman_titanic.age < 18]['name'].count()
print(f'Haba {minor_wo} mujeres menores de 18 aos')

Haba 72 mujeres menores de 18 aos

16. How many woman that were less than 18 actually died? Call the variable `dead_wo`

In [83]:
dead_wo = woman_titanic[(woman_titanic.age < 18) & (woman_titanic.survived == 0)]['name'].count()
print(f'Murieron {dead_wo} mujeres menores de 18 aos')

Murieron 22 mujeres menores de 18 aos

17. Drop rows with *Nan* in `titanic` with `how='any'` and print the shape

In [84]:
titanic.dropna(how='any').shape

(0, 14)

18. Drop rows with *Nan* in `titanic` with `how='all'` and print the shape

In [85]:
titanic.dropna(how='all').shape

(1309, 14)

Check in [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html) why the shapes are different.

19. Drop columns in `titanic` with more than 1000 missing values and print the columns remaining

In [95]:
titanic.isna().sum()

pclass          0
survived        0
name            0
gender          0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [119]:
titanic = titanic.dropna(axis=1, thresh=titanic.shape[0] - 1000)
titanic.head()

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked,boat,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,S,2,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,S,11,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,S,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,S,NaN,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,S,NaN,"Montreal, PQ / Chesterville, ON"

20. Calculate the ratio of missing values at the `boat` column.

In [120]:
titanic['boat'].isna().mean()

0.6287242169595111

21.  Group `titanic` by `'pclass'` and aggregate by the columns `age` & `fare`, by `max` and `median` --> `by_class`

In [121]:
by_class = titanic.groupby('pclass').agg(['max', 'median'])[['age', 'fare']]
by_class

         age             fare
         max median       max   median
pclass
1       80.0   39.0  512.3292  60.0000
2       70.0   29.0   73.5000  15.0458
3       74.0   24.0   69.5500   8.0500

22. Print the maximum age in each class from `by_class`

In [122]:
by_class['age']['max']

pclass
1    80.0
2    70.0
3    74.0
Name: max, dtype: float64

23. Print the median fare in each class from `by_class`

In [123]:
by_class['fare']['median']

pclass
1    60.0000
2    15.0458
3     8.0500
Name: median, dtype: float64

24. Using [`.pivot_table()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html) to count how many women or men survived by class, call it `counted`.

Don't panic and read the documentation!

In [125]:
counted = pd.pivot_table(data=titanic, values='survived', index='pclass', columns='gender', aggfunc='sum')
counted

gender  female  male
pclass
1          139    61
2           94    25
3          106    75

25. Add a new column with the sum of survived men and women, call it `counted['total']`

In [126]:
counted['total'] = counted['female'] + counted['male']
counted

gender  female  male  total
pclass
1          139    61    200
2           94    25    119
3          106    75    181

26. Sort `counted` by the `'total'` column. In which class the people survived the more?

In [129]:
counted.sort_values(by='total', ascending=False)

gender  female  male  total
pclass
1          139    61    200
3          106    75    181
2           94    25    119

27. Please, show only the rows using a mask with the following conditions: 
    - They are woman
    - From third class
    - Younger than 30
    - They survived
    
    How many rows fulfill the condition?

In [131]:
titanic[(titanic.gender == 'female') & (titanic.pclass == 3) & (titanic.age < 30) & (titanic.survived == 1)].shape[0]

57

28. Now, show only the rows using `.loc` with the following conditions: 
    - They are man
    - From first class
    - Older than 50
    - They died
    
    How many rows fulfill the condition?

In [134]:
titanic.loc[(titanic.gender == 'male') & (titanic.pclass == 1) & (titanic.age > 50) & (titanic.survived == 0)].shape[0]

29

29. Print the uniques values at the column `'name'`

In [156]:
for name in titanic['name'].unique():
    print(name)

ley
Richards, Master. William Rowe
Richards, Mrs. Sidney (Emily Hocking)
Ridsdale, Miss. Lucy
Rogers, Mr. Reginald Harry
Rugg, Miss. Emily
Schmidt, Mr. August
Sedgwick, Mr. Charles Frederick Waddington
Sharp, Mr. Percival James R
Shelley, Mrs. William (Imanita Parrish Hall)
Silven, Miss. Lyyli Karoliina
Sincock, Miss. Maude
Sinkkonen, Miss. Anna
Sjostedt, Mr. Ernst Adolf
Slayter, Miss. Hilda Mary
Slemen, Mr. Richard James
Smith, Miss. Marion Elsie
Sobey, Mr. Samuel James Hayden
Stanton, Mr. Samuel Ward
Stokes, Mr. Philip Joseph
Swane, Mr. George
Sweet, Mr. George Frederick
Toomey, Miss. Ellen
Troupiansky, Mr. Moses Aaron
Trout, Mrs. William H (Jessie L)
Troutt, Miss. Edwina Celia "Winnie"
Turpin, Mr. William John Robert
Turpin, Mrs. William John Robert (Dorothy Ann Wonnacott)
Veal, Mr. James
Walcroft, Miss. Nellie
Ware, Mr. John James
Ware, Mr. William Jeffery
Ware, Mrs. John James (Florence Louise Long)
Watson, Mr. Ennis Hastings
Watt, Miss. Bertha J
Watt, Mrs. James (Elizabeth "Bessie" Inglis Milne)
Webber, Miss. Susan
Weisz, Mr. Leopold
Weisz, Mrs. Leopold (Mathilde Francoise Pede)
Wells, Master. Ralph Lester
Wells, Miss. Joan
Wells, Mrs. Arthur Henry ("Addie" Dart Trevaskis)
West, Miss. Barbara J
West, Miss. Constance Mirium
West, Mr. Edwy Arthur
West, Mrs. Edwy Arthur (Ada Mary Worth)
Wheadon, Mr. Edward H
Wheeler, Mr. Edwin "Frederick"
Wilhelms, Mr. Charles
Williams, Mr. Charles Eugene
Wright, Miss. Marion
Yrois, Miss. Henriette ("Mrs Harbeck")
Abbing, Mr. Anthony
Abbott, Master. Eugene Joseph
Abbott, Mr. Rossmore Edward
Abbott, Mrs. Stanton (Rosa Hunt)
Abelseth, Miss. Karen Marie
Abelseth, Mr. Olaus Jorgensen
Abrahamsson, Mr. Abraham August Johannes
Abrahim, Mrs. Joseph (Sophie Halaut Easu)
Adahl, Mr. Mauritz Nils Martin
Adams, Mr. John
Ahlin, Mrs. Johan (Johanna Persdotter Larsson)
Aks, Master. Philip Frank
Aks, Mrs. Sam (Leah Rosen)
Albimona, Mr. Nassef Cassem
Alexander, Mr. William
Alhomaki, Mr. Ilmari Rudolf
Ali, Mr. Ahmed
Ali, Mr. William
Allen, Mr. William Henry
Allum, Mr. Owen George
Andersen, Mr. Albert Karvin
Andersen-Jensen, Miss. Carla Christine Nielsine
Andersson, Master. Sigvard Harald Elias
Andersson, Miss. Ebba Iris Alfrida
Andersson, Miss. Ellis Anna Maria
Andersson, Miss. Erna Alexandra
Andersson, Miss. Ida Augusta Margareta
Andersson, Miss. Ingeborg Constanzia
Andersson, Miss. Sigrid Elisabeth
Andersson, Mr. Anders Johan
Andersson, Mr. August Edvard ("Wennerstrom")
Andersson, Mr. Johan Samuel
Andersson, Mrs. Anders Johan (Alfrida Konstantia Brogren)
Andreasson, Mr. Paul Edvin
Angheloff, Mr. Minko
Arnold-Franchi, Mr. Josef
Arnold-Franchi, Mrs. Josef (Josefine Franchi)
Aronsson, Mr. Ernst Axel Algot
Asim, Mr. Adola
Asplund, Master. Carl Edgar
Asplund, Master. Clarence Gustaf Hugo
Asplund, Master. Edvin Rojj Felix
Asplund, Master. Filip Oscar
Asplund, Miss. Lillian Gertrud
Asplund, Mr. Carl Oscar Vilhelm Gustafsson
Asplund, Mr. Johan Charles
Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)
Assaf Khalil, Mrs. Mariana ("Miriam")
Assaf, Mr. Gerios
Assam, Mr. Ali
Attalah, Miss. Malake
Attalah, Mr. Sleiman
Augustsson, Mr. Albert
Ayoub, Miss. Banoura
Baccos, Mr. Raffull
Backstrom, Mr. Karl Alfred
Backstrom, Mrs. Karl Alfred (Maria Mathilda Gustafsson)
Baclini, Miss. Eugenie
Baclini, Miss. Helene Barbara
Baclini, Miss. Marie Catherine
Baclini, Mrs. Solomon (Latifa Qurban)
Badman, Miss. Emily Louisa
Badt, Mr. Mohamed
Balkic, Mr. Cerin
Barah, Mr. Hanna Assi
Barbara, Miss. Saiide
Barbara, Mrs. (Catherine David)
Barry, Miss. Julia
Barton, Mr. David John
Beavan, Mr. William Thomas
Bengtsson, Mr. John Viktor
Berglund, Mr. Karl Ivar Sven
Betros, Master. Seman
Betros, Mr. Tannous
Bing, Mr. Lee
Birkeland, Mr. Hans Martin Monsen
Bjorklund, Mr. Ernst Herbert
Bostandyeff, Mr. Guentcho
Boulos, Master. Akar
Boulos, Miss. Nourelain
Boulos, Mr. Hanna
Boulos, Mrs. Joseph (Sultana)
Bourke, Miss. Mary
Bourke, Mr. John
Bourke, Mrs. John (Catherine)
Bowen, Mr. David John "Dai"
Bradley, Miss. Bridget Delia
Braf, Miss. Elin Ester Maria
Braund, Mr. Lewis Richard
Braund, Mr. Owen Harris
Brobeck, Mr. Karl Rudolf
Brocklebank, Mr. William Alfred
Buckley, Miss. Katherine
Buckley, Mr. Daniel
Burke, Mr. Jeremiah
Burns, Miss. Mary Delia
Cacic, Miss. Manda
Cacic, Miss. Marija
Cacic, Mr. Jego Grga
Cacic, Mr. Luka
Calic, Mr. Jovo
Calic, Mr. Petar
Canavan, Miss. Mary
Canavan, Mr. Patrick
Cann, Mr. Ernest Charles
Caram, Mr. Joseph
Caram, Mrs. Joseph (Maria Elias)
Carlsson, Mr. August Sigfrid
Carlsson, Mr. Carl Robert
Carr, Miss. Helen "Ellen"
Carr, Miss. Jeannie
Carver, Mr. Alfred John
Celotti, Mr. Francesco
Charters, Mr. David
Chip, Mr. Chang
Christmann, Mr. Emil
Chronopoulos, Mr. Apostolos
Chronopoulos, Mr. Demetrios
Coelho, Mr. Domingos Fernandeo
Cohen, Mr. Gurshon "Gus"
Colbert, Mr. Patrick
Coleff, Mr. Peju
Coleff, Mr. Satio
Conlon, Mr. Thomas Henry
Connaghton, Mr. Michael
Connolly, Miss. Kate
Connors, Mr. Patrick
Cook, Mr. Jacob
Cor, Mr. Bartol
Cor, Mr. Ivan
Cor, Mr. Liudevit
Corn, Mr. Harry
Coutts, Master. Eden Leslie "Neville"
Coutts, Master. William Loch "William"
Coutts, Mrs. William (Winnie "Minnie" Treanor)
Coxon, Mr. Daniel
Crease, Mr. Ernest James
Cribb, Miss. Laura Alice
Cribb, Mr. John Hatfield
Culumovic, Mr. Jeso
Daher, Mr. Shedid
Dahl, Mr. Karl Edwart
Dahlberg, Miss. Gerda Ulrika
Dakic, Mr. Branko
Daly, Miss. Margaret Marcella "Maggie"
Daly, Mr. Eugene Patrick
Danbom, Master. Gilbert Sigvard Emanuel
Danbom, Mr. Ernst Gilbert
Danbom, Mrs. Ernst Gilbert (Anna Sigrid Maria Brogren)
Danoff, Mr. Yoto
Dantcheff, Mr. Ristiu
Davies, Mr. Alfred J
Davies, Mr. Evan
Davies, Mr. John Samuel
Davies, Mr. Joseph
Davison, Mr. Thomas Henry
Davison, Mrs. Thomas Henry (Mary E Finck)
de Messemaeker, Mr. Guillaume Joseph
de Messemaeker, Mrs. Guillaume Joseph (Emma)
de Mulder, Mr. Theodore
de Pelsmaeker, Mr. Alfons
Dean, Master. Bertram Vere
Dean, Miss. Elizabeth Gladys "Millvina"
Dean, Mr. Bertram Frank
Dean, Mrs. Bertram (Eva Georgetta Light)
Delalic, Mr. Redjo
Demetri, Mr. Marinko
Denkoff, Mr. Mitto
Dennis, Mr. Samuel
Dennis, Mr. William
Devaney, Miss. Margaret Delia
Dika, Mr. Mirko
Dimic, Mr. Jovan
Dintcheff, Mr. Valtcho
Doharr, Mr. Tannous
Dooley, Mr. Patrick
Dorking, Mr. Edward Arthur
Dowdell, Miss. Elizabeth
Doyle, Miss. Elizabeth
Drapkin, Miss. Jennie
Drazenoic, Mr. Jozef
Duane, Mr. Frank
Duquemin, Mr. Joseph
Dyker, Mr. Adolf Fredrik
Dyker, Mrs. Adolf Fredrik (Anna Elisabeth Judith Andersson)
Edvardsson, Mr. Gustaf Hjalmar
Eklund, Mr. Hans Linus
Ekstrom, Mr. Johan
Elias, Mr. Dibo
Elias, Mr. Joseph
Elias, Mr. Joseph Jr
Elias, Mr. Tannous
Elsbury, Mr. William James
Emanuel, Miss. Virginia Ethel
Emir, Mr. Farred Chehab
Everett, Mr. Thomas James
Farrell, Mr. James
Finoli, Mr. Luigi
Fischer, Mr. Eberhard Thelander
Fleming, Miss. Honora
Flynn, Mr. James
Flynn, Mr. John
Foley, Mr. Joseph
Foley, Mr. William
Foo, Mr. Choong
Ford, Miss. Doolina Margaret "Daisy"
Ford, Miss. Robina Maggie "Ruby"
Ford, Mr. Arthur
Ford, Mr. Edward Watson
Ford, Mr. William Neal
Ford, Mrs. Edward (Margaret Ann Watson)
Fox, Mr. Patrick
Franklin, Mr. Charles (Charles Fardon)
Gallagher, Mr. Martin
Garfirth, Mr. John
Gheorgheff, Mr. Stanio
Gilinski, Mr. Eliezer
Gilnagh, Miss. Katherine "Katie"
Glynn, Miss. Mary Agatha
Goldsmith, Master. Frank John William "Frankie"
Goldsmith, Mr. Frank John
Goldsmith, Mr. Nathan
Goldsmith, Mrs. Frank John (Emily Alice Brown)
Goncalves, Mr. Manuel Estanslas
Goodwin, Master. Harold Victor
Goodwin, Master. Sidney Leonard
Goodwin, Master. William Frederick
Goodwin, Miss. Jessie Allis
Goodwin, Miss. Lillian Amy
Goodwin, Mr. Charles Edward
Goodwin, Mr. Charles Frederick
Goodwin, Mrs. Frederick (Augusta Tyler)
Green, Mr. George Henry
Gronnestad, Mr. Daniel Danielsen
Guest, Mr. Robert
Gustafsson, Mr. Alfred Ossian
Gustafsson, Mr. Anders Vilhelm
Gustafsson, Mr. Johan Birger
Gustafsson, Mr. Karl Gideon
Haas, Miss. Aloisia
Hagardon, Miss. Kate
Hagland, Mr. Ingvald Olai Olsen
Hagland, Mr. Konrad Mathias Reiersen
Hakkarainen, Mr. Pekka Pietari
Hakkarainen, Mrs. Pekka Pietari (Elin Matilda Dolck)
Hampe, Mr. Leon
Hanna, Mr. Mansour
Hansen, Mr. Claus Peter
Hansen, Mr. Henrik Juul
Hansen, Mr. Henry Damsgaard
Hansen, Mrs. Claus Peter (Jennie L Howard)
Harknett, Miss. Alice Phoebe
Harmer, Mr. Abraham (David Lishin)
Hart, Mr. Henry
Hassan, Mr. Houssein G N
Healy, Miss. Hanora "Nora"
Hedman, Mr. Oskar Arvid
Hee, Mr. Ling
Hegarty, Miss. Hanora "Nora"
Heikkinen, Miss. Laina
Heininen, Miss. Wendla Maria
Hellstrom, Miss. Hilda Maria
Hendekovic, Mr. Ignjac
Henriksson, Miss. Jenny Lovisa
Henry, Miss. Delia
Hirvonen, Miss. Hildur E
Hirvonen, Mrs. Alexander (Helga E Lindqvist)
Holm, Mr. John Fredrik Alexander
Holthen, Mr. Johan Martin
Honkanen, Miss. Eliina
Horgan, Mr. John
Howard, Miss. May Elizabeth
Humblen, Mr. Adolf Mathias Nicolai Olsen
Hyman, Mr. Abraham
Ibrahim Shawah, Mr. Yousseff
Ilieff, Mr. Ylio
Ilmakangas, Miss. Ida Livija
Ilmakangas, Miss. Pieta Sofia
Ivanoff, Mr. Kanio
Jalsevac, Mr. Ivan
Jansson, Mr. Carl Olof
Jardin, Mr. Jose Neto
Jensen, Mr. Hans Peder
Jensen, Mr. Niels Peder
Jensen, Mr. Svend Lauritz
Jermyn, Miss. Annie
Johannesen-Bratthammer, Mr. Bernt
Johanson, Mr. Jakob Alfred
Johansson Palmquist, Mr. Oskar Leander
Johansson, Mr. Erik
Johansson, Mr. Gustaf Joel
Johansson, Mr. Karl Johan
Johansson, Mr. Nils
Johnson, Master. Harold Theodor
Johnson, Miss. Eleanor Ileen
Johnson, Mr. Alfred
Johnson, Mr. Malkolm Joackim
Johnson, Mr. William Cahoone Jr
Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
Johnston, Master. William Arthur "Willie"
Johnston, Miss. Catherine Helen "Carrie"
Johnston, Mr. Andrew G
Johnston, Mrs. Andrew G (Elizabeth "Lily" Watson)
Jonkoff, Mr. Lalio
Jonsson, Mr. Carl
Jonsson, Mr. Nils Hilding
Jussila, Miss. Katriina
Jussila, Miss. Mari Aina
Jussila, Mr. Eiriik
Kallio, Mr. Nikolai Erland
Kalvik, Mr. Johannes Halvorsen
Karaic, Mr. Milan
Karlsson, Mr. Einar Gervasius
Karlsson, Mr. Julius Konrad Eugen
Karlsson, Mr. Nils August
Karun, Miss. Manca
Karun, Mr. Franz
Kassem, Mr. Fared
Katavelas, Mr. Vassilios ("Catavelas Vassilios")
Keane, Mr. Andrew "Andy"
Keefe, Mr. Arthur
Kelly, Miss. Anna Katherine "Annie Kate"
Kelly, Miss. Mary
Kelly, Mr. James
Kennedy, Mr. John
Khalil, Mr. Betros
Khalil, Mrs. Betros (Zahie "Maria" Elias)
Kiernan, Mr. John
Kiernan, Mr. Philip
Kilgannon, Mr. Thomas J
Kink, Miss. Maria
Kink, Mr. Vincenz
Kink-Heilmann, Miss. Luise Gretchen
Kink-Heilmann, Mr. Anton
Kink-Heilmann, Mrs. Anton (Luise Heilmann)
Klasen, Miss. Gertrud Emilia
Klasen, Mr. Klas Albin
Klasen, Mrs. (Hulda Kristina Eugenia Lofqvist)
Kraeff, Mr. Theodor
Krekorian, Mr. Neshan
Lahoud, Mr. Sarkis
Laitinen, Miss. Kristina Sofia
Laleff, Mr. Kristo
Lam, Mr. Ali
Lam, Mr. Len
Landergren, Miss. Aurora Adelia
Lane, Mr. Patrick
Lang, Mr. Fang
Larsson, Mr. August Viktor
Larsson, Mr. Bengt Edvin
Larsson-Rondberg, Mr. Edvard A
Leeni, Mr. Fahim ("Philip Zenni")
Lefebre, Master. Henry Forbes
Lefebre, Miss. Ida
Lefebre, Miss. Jeannie
Lefebre, Miss. Mathilde
Lefebre, Mrs. Frank (Frances)
Leinonen, Mr. Antti Gustaf
Lemberopolous, Mr. Peter L
Lennon, Miss. Mary
Lennon, Mr. Denis
Leonard, Mr. Lionel
Lester, Mr. James
Lievens, Mr. Rene Aime
Lindahl, Miss. Agda Thorilda Viktoria
Lindblom, Miss. Augusta Charlotta
Lindell, Mr. Edvard Bengtsson
Lindell, Mrs. Edvard Bengtsson (Elin Gerda Persson)
Lindqvist, Mr. Eino William
Linehan, Mr. Michael
Ling, Mr. Lee
Lithman, Mr. Simon
Lobb, Mr. William Arthur
Lobb, Mrs. William Arthur (Cordelia K Stanlick)
Lockyer, Mr. Edward
Lovell, Mr. John Hall ("Henry")
Lulic, Mr. Nikola
Lundahl, Mr. Johan Svensson
Lundin, Miss. Olga Elida
Lundstrom, Mr. Thure Edvin
Lyntakoff, Mr. Stanko
MacKay, Mr. George William
Madigan, Miss. Margaret "Maggie"
Madsen, Mr. Fridtjof Arne
Maenpaa, Mr. Matti Alexanteri
Mahon, Miss. Bridget Delia
Mahon, Mr. John
Maisner, Mr. Simon
Makinen, Mr. Kalle Edvard
Mamee, Mr. Hanna
Mangan, Miss. Mary
Mannion, Miss. Margareth
Mardirosian, Mr. Sarkis
Markoff, Mr. Marin
Markun, Mr. Johann
Masselmani, Mrs. Fatima
Matinoff, Mr. Nicola
McCarthy, Miss. Catherine "Katie"
McCormack, Mr. Thomas Joseph
McCoy, Miss. Agnes
McCoy, Miss. Alicia
McCoy, Mr. Bernard
McDermott, Miss. Brigdet Delia
McEvoy, Mr. Michael
McGovern, Miss. Mary
McGowan, Miss. Anna "Annie"
McGowan, Miss. Katherine
McMahon, Mr. Martin
McNamee, Mr. Neal
McNamee, Mrs. Neal (Eileen O'Leary)
McNeill, Miss. Bridget
Meanwell, Miss. (Marion Ogden)
Meek, Mrs. Thomas (Annie Louise Rowley)
Meo, Mr. Alfonzo
Mernagh, Mr. Robert
Midtsjo, Mr. Karl Albert
Miles, Mr. Frank
Mineff, Mr. Ivan
Minkoff, Mr. Lazar
Mionoff, Mr. Stoytcho
Mitkoff, Mr. Mito
Mockler, Miss. Helen Mary "Ellie"
Moen, Mr. Sigurd Hansen
Moor, Master. Meier
Moor, Mrs. (Beila)
Moore, Mr. Leonard Charles
Moran, Miss. Bertha
Moran, Mr. Daniel J
Moran, Mr. James
Morley, Mr. William
Morrow, Mr. Thomas Rowan
Moss, Mr. Albert Johan
Moubarek, Master. Gerios
Moubarek, Master. Halim Gonios ("William George")
Moubarek, Mrs. George (Omine "Amenia" Alexander)
Moussa, Mrs. (Mantoura Boulos)
Moutal, Mr. Rahamin Haim
Mullens, Miss. Katherine "Katie"
Mulvihill, Miss. Bertha E
Murdlin, Mr. Joseph
Murphy, Miss. Katherine "Kate"
Murphy, Miss. Margaret Jane
Murphy, Miss. Nora
Myhrman, Mr. Pehr Fabian Oliver Malkolm
Naidenoff, Mr. Penko
Najib, Miss. Adele Kiamie "Jane"
Nakid, Miss. Maria ("Mary")
Nakid, Mr. Sahid
Nakid, Mrs. Said (Waika "Mary" Mowad)
Nancarrow, Mr. William Henry
Nankoff, Mr. Minko
Nasr, Mr. Mustafa
Naughton, Miss. Hannah
Nenkoff, Mr. Christo
Nicola-Yarred, Master. Elias
Nicola-Yarred, Miss. Jamila
Nieminen, Miss. Manta Josefina
Niklasson, Mr. Samuel
Nilsson, Miss. Berta Olivia
Nilsson, Miss. Helmina Josefina
Nilsson, Mr. August Ferdinand
Nirva, Mr. Iisakki Antino Aijo
Niskanen, Mr. Juha
Nosworthy, Mr. Richard Cater
Novel, Mr. Mansouer
Nysten, Miss. Anna Sofia
Nysveen, Mr. Johan Hansen
O'Brien, Mr. Thomas
O'Brien, Mr. Timothy
O'Brien, Mrs. Thomas (Johanna "Hannah" Godfrey)
O'Connell, Mr. Patrick D
O'Connor, Mr. Maurice
O'Connor, Mr. Patrick
Odahl, Mr. Nils Martin
O'Donoghue, Ms. Bridget
O'Driscoll, Miss. Bridget
O'Dwyer, Miss. Ellen "Nellie"
Ohman, Miss. Velin
O'Keefe, Mr. Patrick
O'Leary, Miss. Hanora "Norah"
Olsen, Master. Artur Karl
Olsen, Mr. Henry Margido
Olsen, Mr. Karl Siegwart Andreas
Olsen, Mr. Ole Martin
Olsson, Miss. Elina
Olsson, Mr. Nils Johan Goransson
Olsson, Mr. Oscar Wilhelm
Olsvigen, Mr. Thor Anderson
Oreskovic, Miss. Jelka
Oreskovic, Miss. Marija
Oreskovic, Mr. Luka
Osen, Mr. Olaf Elon
Osman, Mrs. Mara
O'Sullivan, Miss. Bridget Mary
Palsson, Master. Gosta Leonard
Palsson, Master. Paul Folke
Palsson, Miss. Stina Viola
Palsson, Miss. Torborg Danira
Palsson, Mrs. Nils (Alma Cornelia Berglund)
Panula, Master. Eino Viljami
Panula, Master. Juha Niilo
Panula, Master. Urho Abraham
Panula, Mr. Ernesti Arvid
Panula, Mr. Jaako Arnold
Panula, Mrs. Juha (Maria Emilia Ojala)
Pasic, Mr. Jakob
Patchett, Mr. George
Paulner, Mr. Uscher
Pavlovic, Mr. Stefo
Peacock, Master. Alfred Edward
Peacock, Miss. Treasteall
Peacock, Mrs. Benjamin (Edith Nile)
Pearce, Mr. Ernest
Pedersen, Mr. Olaf
Peduzzi, Mr. Joseph
Pekoniemi, Mr. Edvard
Peltomaki, Mr. Nikolai Johannes
Perkin, Mr. John Henry
Persson, Mr. Ernst Ulrik
Peter, Master. Michael J
Peter, Miss. Anna
Peter, Mrs. Catherine (Catherine Rizk)
Peters, Miss. Katie
Petersen, Mr. Marius
Petranec, Miss. Matilda
Petroff, Mr. Nedelio
Petroff, Mr. Pastcho ("Pentcho")
Petterson, Mr. Johan Emil
Pettersson, Miss. Ellen Natalia
Pickard, Mr. Berk (Berk Trembisky)
Plotcharsky, Mr. Vasil
Pokrnic, Mr. Mate
Pokrnic, Mr. Tome
Radeff, Mr. Alexander
Rasmussen, Mrs. (Lena Jacobsen Solvang)
Razi, Mr. Raihed
Reed, Mr. James George
Rekic, Mr. Tido
Reynolds, Mr. Harold J
Rice, Master. Albert
Rice, Master. Arthur
Rice, Master. Eric
Rice, Master. Eugene
Rice, Master. George Hugh
Rice, Mrs. William (Margaret Norton)
Riihivouri, Miss. Susanna Juhantytar "Sanni"
Rintamaki, Mr. Matti
Riordan, Miss. Johanna "Hannah"
Risien, Mr. Samuel Beard
Risien, Mrs. Samuel (Emma)
Robins, Mr. Alexander A
Robins, Mrs. Alexander A (Grace Charity Laury)
Rogers, Mr. William John
Rommetvedt, Mr. Knud Paust
Rosblom, Miss. Salli Helena
Rosblom, Mr. Viktor Richard
Rosblom, Mrs. Viktor (Helena Wilhelmina)
Roth, Miss. Sarah A
Rouse, Mr. Richard Henry
Rush, Mr. Alfred George John
Ryan, Mr. Edward
Ryan, Mr. Patrick
Saad, Mr. Amin
Saad, Mr. Khalil
Saade, Mr. Jean Nassr
Sadlier, Mr. Matthew
Sadowitz, Mr. Harry
Saether, Mr. Simon Sivertsen
Sage, Master. Thomas Henry
Sage, Master. William Henry
Sage, Miss. Ada
Sage, Miss. Constance Gladys
Sage, Miss. Dorothy Edith "Dolly"
Sage, Miss. Stella Anna
Sage, Mr. Douglas Bullen
Sage, Mr. Frederick
Sage, Mr. George John Jr
Sage, Mr. John George
Sage, Mrs. John (Annie Bullen)
Salander, Mr. Karl Johan
Salkjelsvik, Miss. Anna Kristine
Salonen, Mr. Johan Werner
Samaan, Mr. Elias
Samaan, Mr. Hanna
Samaan, Mr. Youssef
Sandstrom, Miss. Beatrice Irene
Sandstrom, Mrs. Hjalmar (Agnes Charlotta Bengtsson)
Sandstrom, Miss. Marguerite Rut
Sap, Mr. Julius
Saundercock, Mr. William Henry
Sawyer, Mr. Frederick Charles
Scanlan, Mr. James
Sdycoff, Mr. Todor
Shaughnessy, Mr. Patrick
Sheerlinck, Mr. Jan Baptist
Shellard, Mr. Frederick William
Shine, Miss. Ellen Natalia
Shorney, Mr. Charles Joseph
Simmons, Mr. John
Sirayanian, Mr. Orsen
Sirota, Mr. Maurice
Sivic, Mr. Husein
Sivola, Mr. Antti Wilhelm
Sjoblom, Miss. Anna Sofia
Skoog, Master. Harald
Skoog, Master. Karl Thorsten
Skoog, Miss. Mabel
Skoog, Miss. Margit Elizabeth
Skoog, Mr. Wilhelm
Skoog, Mrs. William (Anna Bernhardina Karlsson)
Slabenoff, Mr. Petco
Slocovski, Mr. Selman Francis
Smiljanic, Mr. Mile
Smith, Mr. Thomas
Smyth, Miss. Julia
Soholt, Mr. Peter Andreas Lauritz Andersen
Somerton, Mr. Francis William
Spector, Mr. Woolf
Spinner, Mr. Henry John
Staneff, Mr. Ivan
Stankovic, Mr. Ivan
Stanley, Miss. Amy Zillah Elsie
Stanley, Mr. Edward Roland
Storey, Mr. Thomas
Stoytcheff, Mr. Ilia
Strandberg, Miss. Ida Sofia
Stranden, Mr. Juho
Strilic, Mr. Ivan
Strom, Miss. Telma Matilda
Strom, Mrs. Wilhelm (Elna Matilda Persson)
Sunderland, Mr. Victor Francis
Sundman, Mr. Johan Julian
Sutehall, Mr. Henry Jr
Svensson, Mr. Johan
Svensson, Mr. Johan Cervin
Svensson, Mr. Olof
Tenglin, Mr. Gunnar Isidor
Theobald, Mr. Thomas Leonard
Thomas, Master. Assad Alexander
Thomas, Mr. Charles P
Thomas, Mr. John
Thomas, Mr. Tannous
Thomas, Mrs. Alexander (Thamine "Thelma")
Thomson, Mr. Alexander Morrison
Thorneycroft, Mr. Percival
Thorneycroft, Mrs. Percival (Florence Kate White)
Tikkanen, Mr. Juho
Tobin, Mr. Roger
Todoroff, Mr. Lalio
Tomlin, Mr. Ernest Portage
Torber, Mr. Ernst William
Torfa, Mr. Assad
Tornquist, Mr. William Henry
Toufik, Mr. Nakli
Touma, Master. Georges Youssef
Touma, Miss. Maria Youssef
Touma, Mrs. Darwis (Hanne Youssef Razi)
Turcin, Mr. Stjepan
Turja, Miss. Anna Sofia
Turkula, Mrs. (Hedwig)
van Billiard, Master. James William
van Billiard, Master. Walter John
van Billiard, Mr. Austin Blyler
Van Impe, Miss. Catharina
Van Impe, Mr. Jean Baptiste
Van Impe, Mrs. Jean Baptiste (Rosalie Paula Govaert)
van Melkebeke, Mr. Philemon
Vande Velde, Mr. Johannes Joseph
Vande Walle, Mr. Nestor Cyriel
Vanden Steen, Mr. Leo Peter
Vander Cruyssen, Mr. Victor
Vander Planke, Miss. Augusta Maria
Vander Planke, Mr. Julius
Vander Planke, Mr. Leo Edmondus
Vander Planke, Mrs. Julius (Emelia Maria Vandemoortele)
Vartanian, Mr. David
Vendel, Mr. Olof Edvin
Vestrom, Miss. Hulda Amanda Adolfina
Vovk, Mr. Janko
Waelens, Mr. Achille
Ware, Mr. Frederick
Warren, Mr. Charles William
Webber, Mr. James
Wenzel, Mr. Linhart
Whabee, Mrs. George Joseph (Shawneene Abi-Saab)
Widegren, Mr. Carl/Charles Peter
Wiklund, Mr. Jakob Alfred
Wiklund, Mr. Karl Johan
Wilkes, Mrs. James (Ellen Needs)
Willer, Mr. Aaron ("Abi Weller")
Willey, Mr. Edward
Williams, Mr. Howard Hugh "Harry"
Williams, Mr. Leslie
Windelov, Mr. Einar
Wirz, Mr. Albert
Wiseman, Mr. Phillippe
Wittevrongel, Mr. Camille
Yasbeck, Mr. Antoni
Yasbeck, Mrs. Antoni (Selini Alexander)
Youseff, Mr. Gerious
Yousif, Mr. Wazli
Yousseff, Mr. Gerious
Zabour, Miss. Hileni
Zabour, Miss. Thamine
Zakarian, Mr. Mapriededer
Zakarian, Mr. Ortin
Zimmerman, Mr. Leo

30. Find if was there any `name` repeated at the Titanic?

Hint: There were two people with the same name, who?

In [143]:
titanic.name[titanic.name.duplicated(keep=False)]

725    Connolly, Miss. Kate
726    Connolly, Miss. Kate
924        Kelly, Mr. James
925        Kelly, Mr. James
Name: name, dtype: object

31. Well done! You did it! I can tell you are a real master with Pandas. Please, now save the dataframe as a `.csv` since you will use it in a future exercise `Titanic-Visualisation`. The name of the `.csv` you'll generate should be `titanic_cleaned.csv`.

Use for that aim the following pandas's method: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html

Make sure you use the argument `index = False`.

In [146]:
titanic.to_csv('../data/titanic_cleaned.csv')